import React, { Component } from "react";
export class Description extends Component {
  render() {
    return (
      <div class="card">
        <div class="card-content">
          <h3 class="sec-title">توضیحات تکمیلی دوره</h3>
          <div class="abs">
            اهداف این دوره به اختصار شامل چگونگی روند شروع و به پایان رساندن یک
            پروژه فیلم مستند، زیبایی شناسی تدوین و ایجاد فرم و طرح مونتاژ فیلم
            مستند، کار با نرم افزار ادوب پریمیر و تکنیک های مونتاژ فیلم مستند
            خواهد بود. زمان بندی این دوره از آموزش در ده جلسه سه ساعته و جمعا سی
            ساعت برگزار خواهد شد. این دوره همچنین برای افرادی که قصد تولید
            محتوای آموزشی، فرهنگی و هنری و غیره را دارند توصیه می شود. هنرجویان
            در این دوره یک مستند کوتاه را به عنوان پروژه کلاسی با همراهی و
            راهنمایی مدرس به طور کامل تدوین خواهند کرد. آموزش تدوین فیلم مستند
            در روش آنلاین کاملا کاربردی و قابل دریافت است و به مراتب از برگزاری
            کلاس حضوری مفیدتر خواهد بود و باعث صرفه جویی در وقت و هزینه هنرجویان
            می شود. لطفا قبل از تکمیل ثبت نام و مرحله پرداخت با ما در ارتباط
            باشید. اهداف این دوره به اختصار شامل چگونگی روند شروع و به پایان
            رساندن یک پروژه فیلم مستند، زیبایی شناسی تدوین و ایجاد فرم و طرح
            مونتاژ فیلم مستند، کار با نرم افزار ادوب پریمیر و تکنیک های مونتاژ
            فیلم مستند خواهد بود.
          </div>
          <div class="abs">
            <p>
              <br />
              اهداف این دوره به اختصار شامل چگونگی روند شروع و به پایان رساندن
              یک پروژه فیلم مستند، زیبایی شناسی تدوین و ایجاد فرم و طرح مونتاژ
              فیلم مستند، کار با نرم افزار ادوب پریمیر و تکنیک های مونتاژ فیلم
              مستند خواهد بود. &nbsp;لطفا قبل از تکمیل ثبت نام و مرحله پرداخت با
              ما در ارتباط باشید.
            </p>
            <p>و صفحه استودیو فیلم کلوزآپ را در اینستاگرام دنبال کنید.</p>
          </div>
        </div>
      </div>
    );
  }
}
