import React, { Component } from "react";
import "./about.css";
export class About extends Component {
  render() {
    return (
      <div className="container">
        <p className="page-help">
          لطفاً آموزشگاهها، مدارس، مدرسان، دانش پذیران و والدین هرکدام مطالب
          مربوط به خود در انتهای همین صفحه را نیز مطالعه نمایند.
        </p>

        <h3 className="titr">کلیاتی درباره آموزش آنلاین</h3>

        <h1
          className="about-us"
          style={{ fontSize: "30px", textAlign: "center", lineHeight: "45px" }}
        >
          برگ دانش،
          <br />
          بزرگترین آموزشگاه همراه شما
        </h1>

        <div className="container featured text-center">
          {/* <video controls="" __idm_id__="199918593">
            <source
              src="/Content/Videos/OnlineAamoozan720.mp4"
              type="video/mp4"
            >
              این ویدیو در بروزر شما قابل پخش نیست!
            </source>
          </video> */}
        </div>

        <h3 className="titr">خلاصه:</h3>
        <p>
          ارائه دهندگان خدمات آموزشی (معلمان، مدرسین، اساتید، مدارس، موسسات
          آموزشی، دانشگاهها، ادارات و سازمانها، آموزشگاه ها و ...) با هر تخصصی و
          از هرکجای دنیا بدون نیاز به صرف هزینه و زمان برای آماده سازی کلاس و
          تبلیغات و ...، می توانند در هر ساعتی و از هر مکانی، در برگ دانش
          کلاسهای آنلاین (همزمان) تعریف کنند، به بازدید کنندگان نمایش دهند و به
          صورت اینترنتی دانش پذیر جذب نمایند و در همین سایت کلاس تشکیل دهند. در
          دهکده جهانی اینترنت، بدون محدودیت شوید و ظرفیت پذیرش و ثبت نام را به
          بی نهایت ارتقا دهید. جویندگان خدمات آموزشی (محصلین، دانشجویان، کنکوری
          ها، کارمندان و همه اقشار جامعه) از هرکجا، هر مکان و با هر سنی و هر
          شرایط کاری، هرگونه کلاس آموزشی خود را در سایت برگ دانش جستجو
          کرده، ثبت نمام نمایند و در کلاسهای اینترنتی همزمان شرکت نمایند. بهترین
          مکان برای جستجوگران بهترین آموزشها فراهم شده است. در برگ دانش هر
          آموزشگاهی می تواند در همه جای دنیا کلاس بگذارد،{" "}
          <span className="green-highlight">
            هر مدرسی می تواند در برگ دانش در هر آموزشگاهی کار کند
          </span>
          ، هر مدرسی می تواند هرچه تخصص دارد در برگ دانش ارائه دهد، هر دانش
          طلبی می تواند در برگ دانش از کلاس هر مدرسی در سطح دنیا استفاده
          کند، هر آموزشگاهی می تواند در برگ دانش از هر مدرسی دعوت به همکاری
          نماید، هر دانش آموزی می تواند با برگ دانش از هرکجا در کلاسش شرکت
          کند، هر والدینی می تواند با برگ دانش به هرکجا می خواهد سفر کند
          ولی کلاس های خود و فرزندانش را از دست ندهد .....
        </p>

        <h3 className="titr"> درباره برگ دانش: </h3>
        <p>
          برگ دانش یک سایت اینترنت است که بستری ایجاد می نماید تا در آن
          تمامی ارائه دهندگان خدمات آموزشی از جمله معلمان، دبیران، اساتید،
          متخصصان، مدارس، آموزشگاههای علمی و آزاد، موسسات آموزشی، انتشارات کتب
          آموزشی، مشاوران تحصیلی، سازمانها و ادارات و شرکتها و هر شخص یا ارگانی،
          <span className="text-underline">خدمات آموزشی </span>
          خود از قبیل کلاس آنلاین، آزمون آنلاین، مشاوره آنلاین، کلاس زبان
          آنلاین، فروشگاه کتاب آنلاین، محتویات کمک آموزشی و ... را در اینترنت به
          صورت خصوصی یا عمومی ارائه نمایند. هیچ محدودیتی برای تعریف و معرفی
          کلاسها و آزمونها و خدمات آموزشی وجود ندارد و تعریف کلاس و آزمون و
          معرفی خدمات و ایجاد پروفایل در این سایت رایگان می باشد.
          <br />
          با توجه به مزایای فراوان آموزش مجازی برای جنبه های مختلف درگیر در بحث
          آموزش شامل والدین، دانش آموزان، دانشجویان، مدرسین، موسسات و مدارس،
          ترافیک و محیط زیست و کل جامعه که در انتها لیست شده است، و پیشرفت روز
          افزون تکنولوزی و گسترش نفوذ اینترنت در جامعه و افزایش خدمات اینترنتی،
          لازم است تا از این طریق درهای جدیدی به دنیای جدید آموزش و یادگیری
          گشوده شود.
          <br />
          تقریبا تمامی آموزشها و آزمونهای حضوری را می توان در بستر اینترنت ارائه
          نمود و از مزایای آن بهره جست. به عنوان مثال: مدارس می توانند کلاسهای
          فوق برنامه و آزمونهای دوره ای خود و ... را در بستر این سایت تعریف و
          تشکیل نمایند تا در هزینه های خود صرفه جویی کنند ضمن اینکه دانش آموزان
          در منزل یا هرکجایی که هستند و دسترسی به اینترنت دارند، در کمال آرامش
          در کلاس فوق برنامه یا آزمون اینترنتی شرکت می نمایند.
          <br />
          آموزشگاههای علمی آزاد می توانند کلاسهای کنکور و کلاسهای آموزش ICDL،
          دوره های تخصصی، آزمونهای دوره ای و ... را در سایت برگ دانش تعریف
          و از این طریق متقاضیان بیشتری جذب نمایند.
          <br />
          شرکت ها و سازمانها به جای آنکه همکاران خود را از سراسر کشور یا استان
          برای شرکت در یک دوره آموزشی فراخوان نمایند و هزینه های گزاف متقبل
          شوند، می توانند با تعریف کلاس در سایت برگ دانش، بدون جابجا کردن
          همکاران خود آموزشهای لازم را در اسرع وقت و به بهترین نحو به پرسنل
          ارائه نمایند.
          <br />
          موسسات هنری، قرانی و دینی و مراکز فرهنگی می توانند کلاسهایی در سایت
          آنلای آموزان تعریف و متقاضیان خود را برای استفاده از آنها تشویق
          نمایند.
          <br />
          برای آموزشگاهها در شهرهای شلوغ و پرترافیک، شهرها و استانهای خیلی گرم
          که در تابستان تقریبا کلاسهای حضوری تعطیل هستند و برای آموزشگاه های قوی
          و مشهور که در سطح کشور شناخته شده هستند سایت برگ دانش فرصتی طلایی
          درجهت پیشرفت و جذب دانش طلب بیشتر و درآمد بیشتر خواهد بود.
          <br />
          آموزشگاه زبانی که{" "}
          <span className="yellow-highlight">
            {" "}
            در یک گوشه شهر ساختمانی با ظرفیت مشخص و محدود برای کلاسهای خود دارند{" "}
          </span>{" "}
          در جذب مشتریانی که راه طولانی تا مکان آموزشگاه دارند موفق نخواهد بود،
          والدینی که دارای سطح ضعیف زبان هستند تمایل به شرکت در کلاسهای حضوری در
          کنار کودکان و نوجوانان ندارند. راه حل چیست؟ برگ دانش با برگزاری
          کلاسهای زبان در بستر اینترنت هم محدوده جذب دانش آموز و هم ظرفیت پذیرش
          شما را بی نهایت می کند و هم برای افراد میانسال که علاقمند یادگیری زبان
          هستند راه حلیست تا در منزل و بدون شناخته شدن در کلاس شرکت کنند.
          <br />
          کلاس اینترنتی در سایت برگ دانش توسط برنامه{" "}
          <span className="text-underline"> اسکای روم </span> که تولید متخصصان
          داخلیست برگزار می گردد. این برنامه بسیار قوی و پرامکانات از قبیل امکان
          به کارگیری چند وایت برد، امکان ارئه عکس، فیلم، پاورپوینت، فایلهای ورد،
          نمایش صفحه دسکتاپ و به اشتراک گذاری فایل، چت بین استاد و دانشجو، حضور
          و غیاب و ... می باشد و نه تنها کاستی ای از برنامه های مشابه خارجی
          ندارد بلکه با امکانات بی نظیر و دارای سرعت بیشتری بوده و بدون هیچ
          برنامه اضافه ای در هر مرورگری و در تمامی دستگاهها (کامپیوتر، تبلت و
          گوشی موبایل) قابلیت اجرا دارد. منوهای این برنامه فارسی بوده و برای
          استفاده کاربران فارسی زبان تهیه شده است. برنامه های خارجی دارای منوهای
          انگلیسی هستند که برای همه قابل فهم نیستند و ضمن اینکه با مشکل احتمال
          تحریم و نرسیدن آپدیتها و داشتن پلاگین مواجه هستند که این مشکلات در
          برنامه اسکای روم وجود ندارد.
          <br />
          مدرس یا شرکت کنندگان می توانند در هنگام ثبت نام کلاس درخواست کنند که
          دقایق یا ساعاتی قبل از شروع کلاس به ایشان از طریق پیامک یا تلگرام
          اطلاع رسانی گردد. در سایت برگ دانش امکان ارسال پیام از ثبت نام
          کنندگان کلاسها به مدرس و بالعکس وجود دارد و این پیام هم در صفحه
          پروفایل مدرس در سایت نمایش داده می شود و هم امکان ارسال پیامک و تلگرام
          نیز وجود دارد.
          <br />
        </p>

        <p>تعرفه ها، تخفیفات و پیشنهادات ویژه</p>
        <br />

        <h5 className="text-center">
          نام شرکت: آرتین برخط سایا آموزان
          <br />
          آدرس اینترنتی: onlineamoozan.ir و onlineamoozan.com
        </h5>
      </div>
    );
  }
}
