const data = {
  campaigns: [{ title: "test" }],
};

export function login(username, password) {
  return Promise.resolve({
    status: 200,
    data: { token: "435hjkfdstfufisdfhs9u0idhisfoh" },
  });
}
export function getProducts() {
  return Promise.resolve({
    status: 200,
    data: {
      products: [
        {
          _id: 1,
          teacher_name: "بردیا علمی",
          teacher_description: "خی",
          schedules: [
            { date: "1399/05/03", time: "1:30", priod: "11", _id: "61" },
            { date: "1399/05/04", time: "1:30", priod: "5", _id: "62" },
            { date: "1399/05/05", time: "1:30", priod: "5", _id: "63" },
            { date: "1399/05/06", time: "1:30", priod: "5", _id: "64" },
          ],
          start_at: "1399/05/04",
          title:
            "فتوشاپ مقدماتی و کاربردی مخصوص بازار طراحی گرافیک ( برای دومین بار)",
          price: "300000",
          image:
            "http://onlineamoozan.ir/Uploads/Courses/%D9%81%D8%AA%D9%88%D8%B4%D8%A7%D9%BE-%D9%85%D9%82%D8%AF%D9%85%D8%A7%D8%AA%DB%8C-%D9%88-%DA%A9%D8%A7%D8%B1%D8%A8%D8%B1%D8%AF%DB%8C-%D9%85%D8%AE%D8%B5%D9%88%D8%B5-%D8%A8%D8%A7%D8%B2%D8%A7%D8%B1-%D8%B7%D8%B1%D8%A7%D8%AD%DB%8C-%DA%AF%D8%B1%D8%A7%D9%81%DB%8C%DA%A9-%D8%A8%D8%B1%D8%A7%DB%8C-%D8%AF%D9%88%D9%85%DB%8C%D9%86-%D8%A8%D8%A7%D8%B1-71d743a454824b16ab20dc54314f09c4-th.jpg",
          description: `نرم افزار فتوشاپ بهترین، معتبرترین و پرطرفدارترین نرم افزار Raster Base در دنیاست که مطمئنم حتمن حداقل 1 بار نام این نرم افزار به گوش تمام انسان های کره ی زمین خورده است.
        توجه:
        
        ( اگر علاقه مند به روتوش عکس، روتوش صورت، فتوشاپ مخصوص آتلیه، عروسی و... هستید، به هیچ عنوان این دوره رو ثبت نام نکنید)
        
        دوره ی پیش رو به طور اختصاصی برای عزیزانی طراحی شده است که برای فعالیت در دنیای طراحی گرافیک آماده می شوند.
        
        همانطور که به احتمال زیاد می دانید فتوشاپ نرم افزاری بسیار دوست داشتنی با کاربردهای متفاوت دردنیای عکاسی، گرافیک، تصویر سازی و .. است.
        
        یکی از بزرگترین کاربردهای این نرم افزار آماده سازی فایل های تصویری برای چاپ افست یا استفاده در طراحی گرافیک است.
        
        در این دوره با آموزش مقدماتی این نرم افزار در کنار شما خواهم بود که بنا به تجربه ی شخصی و استفاده ی این نرم افزار در دنیای طراحی گرافیک و آموزش های مقدماتی تا کاربردی ، بتونم ابزار ها و موارد کاربردی و بسیار مهم رو به شما آموزش بدم.
        
        از آنجا که فتوشاپ نرم افزاری است که خیلی از هنرجوها فقط برای روتوش تصویر ازش استفاده می کنن، لازم به ذکر است که در این دوره به هیچ عنوان به سراغ روتوش صورت، فتوشاپ مخصوص عکاسی و این موارد نخواهیم رفت، بلکه اتفاق های مخصوص کار در وادی طراحی گرافیک رو با هم بررسی و آموزش می بینیم.
        
        مواردی که در این دوره با هم یاد خواهیم گرفت
        
        1- تنظیمات و ذخیره سازی Inter Face فتوشاپ
        
        2- روش استفاده از کی بورد برای سرعت بخشیدن به کار با فتوشاپ
        
        3- تمام ابزارهای پر کاربرد در اجرای فایل های گرافیکی
        
        Pen / Marquee / Magic Wand / Lasso / Eyedropper  / Crop / Perspective Crop / move/ Gradient / zoom
        
        Pattern Stamp / Clone Stamp / Fill /
        
        4- روتوش تصاویر مخصوص گرافیک
        
        Healing Brush / Spot Healing Brush / patch / Content Aware
        
        5- روش ساخت فایل جدید مخصوص چاپ افست
        
        6- روش ساخت براش
        
        7- روش ساخت پترن
        
        8-  تنظیم مود رنگی فایل
        
        9- تفاوت RGB و CMYK به زبان ساده
        
        10- استفاده از Shape ها در فتوشاپ
        
        1- روش ساخت اسمارت آبجکت و دلیل استفاده از آن
        
        12- لایه ها Layers
        
        13- کانال ها Channels
        
        14- مسیر Path
        
        15- پالت رنگ
        
        16- Select And Mask
        
        17-دوربری های حرفه ای
        
        18- آموزش کامل ابزار pen
        
        19-  Refine Edge
        
        20- Transform / Scale / Rotate / Flip
        
        21- Guid / Grid
        
        22- Place Embedded / Place Linked
        
        Text / Paragraph Text -23
        
        ارتباط فتوشاپ با ایلوستریتور
        
        24- ارسال تصویر به ایلوستریتور
        
        25- دریافت فایل از ایلوستریتور
        
        26- Hue / Saturation / Vibrance / invert / Gradient Map
        
        - بسیاری از موارد نیز هنگام برگزاری کلاس و با سوال هایی که شما خواهید داشت توضیح داده خواهد شد.
        
        - نتیجه گیری این کلاس:
        آمادگی کامل برای شرکت در دوره های پروژه محور
        
        آمادگی کامل برای تبدیل شدن به یک حرفه ای در نرم افزار فتوشاپ ( از نظر ابزاری)
        
        آماده شدن ذهن شما برای فراگیری نرم افزار های ادوبی ( به دلیل اینکه ابزارهای و مواردی که در فتوشاپ وجود دارد بسیار شبیه به نرم افزار های دیگر کمپانی ادوبی است به همین دلیل شما با آشنایی کامل به فتوشاپ میتونید به راحتی در مورد یادگیری نرم افزارهای دیگر این کمپانی اقدام کنید، البته این نرم افزار پیش نیاز نرم افزار دیگری نیست اما نیاز اصلی برای انجام امور طراحی گرافیک می باشد)
        
        برای آشنایی بیشتر با من (بردیا علمی) میتونید به اینستاگرام من و وب سایت آموزشی بردیا علمی من سر بزنید.
        
        شاد و سلامت باشید.
        
        `,
        },
        {
          _id: 2,
          teacher_name: "هومن بابانوروزی ",
          teacher_description: "گومنگو",
          schedules: [
            { date: "1399/05/03", time: "1:30", priod: "3", _id: "61" },
            { date: "1399/05/04", time: "1:30", priod: "5", _id: "62" },
            { date: "1399/05/05", time: "1:30", priod: "5", _id: "63" },
            { date: "1399/05/06", time: "1:30", priod: "5", _id: "64" },
          ],
          start_at: "1399/05/04",
          title: "آموزش تدوین فیلم مستند دوره سوم « نیمه خصوصی »",
          price: "1500000",
          image:
            "http://onlineamoozan.ir/Uploads/Courses/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D8%AA%D8%AF%D9%88%DB%8C%D9%86-%D9%81%DB%8C%D9%84%D9%85-%D9%85%D8%B3%D8%AA%D9%86%D8%AF-%D8%AF%D9%88%D8%B1%D9%87-%D8%B3%D9%88%D9%85-%D9%86%DB%8C%D9%85%D9%87-%D8%AE%D8%B5%D9%88%D8%B5%DB%8C-595c5dfc840c4597afd92c75428ab787-th.jpg",
          description: `  
        اهداف این دوره به اختصار شامل چگونگی روند شروع و به پایان رساندن یک پروژه فیلم مستند، زیبایی شناسی تدوین و ایجاد فرم و طرح مونتاژ فیلم مستند، کار با نرم افزار ادوب پریمیر و تکنیک های مونتاژ فیلم مستند خواهد بود. زمان بندی این دوره از آموزش در ده جلسه سه ساعته و جمعا سی ساعت برگزار خواهد شد. این دوره همچنین برای افرادی که قصد تولید محتوای آموزشی، فرهنگی و هنری و غیره را دارند توصیه می شود. هنرجویان در این دوره یک مستند کوتاه را با همراهی و راهنمایی مدرس به طور کامل تدوین خواهند کرد. آموزش تدوین فیلم مستند در روش آنلاین کاملا کاربردی و قابل دریافت است و به مراتب از برگزاری کلاس حضوری مفیدتر خواهد بود و باعث صرفه جویی در وقت و هزینه هنرجویان می شود. لطفا قبل از تکمیل ثبت نام و مرحله پرداخت با ما در ارتباط باشید. اهداف این دوره به اختصار شامل چگونگی روند شروع و به پایان رساندن یک پروژه فیلم مستند، زیبایی شناسی تدوین و ایجاد فرم و طرح مونتاژ فیلم مستند، کار با نرم افزار ادوب پریمیر و تکنیک های مونتاژ فیلم مستند خواهد بود.
        
        اهداف این دوره به اختصار شامل چگونگی روند شروع و به پایان رساندن یک پروژه فیلم مستند، زیبایی شناسی تدوین و ایجاد فرم و طرح مونتاژ فیلم مستند، کار با نرم افزار ادوب پریمیر و تکنیک های مونتاژ فیلم مستند خواهد بود.  لطفا قبل از تکمیل ثبت نام و مرحله پرداخت با ما در ارتباط باشید.
        
        و صفحه استودیو فیلم کلوزآپ را در اینستاگرام دنبال کنید.`,
        },
        {
          _id: 3,
          teacher_name: "موحد شادرو",
          teacher_description: "خله خی اصن خاده خی",
          schedules: [
            { date: "1399/05/03", time: "1:30", priod: "4", _id: "61" },
            { date: "1399/05/04", time: "1:30", priod: "5", _id: "62" },
            { date: "1399/05/05", time: "1:30", priod: "5", _id: "63" },
            { date: "1399/05/06", time: "1:30", priod: "5", _id: "64" },
          ],
          start_at: "1399/05/04",
          title:
            "فتوشاپ مقدماتی و کاربردی مخصوص بازار طراحی گرافیک ( برای دومین بار)",
          price: "300000",
          image:
            "http://onlineamoozan.ir/Uploads/Courses/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-Adobe-Premiere-Pro-%D8%AF%D9%88%D8%B1%D9%87-%D9%BE%DB%8C%D8%B4%D8%B1%D9%81%D8%AA%D9%87-%D9%88-%D8%AA%DA%A9%D9%85%DB%8C%D9%84%DB%8C-%D8%A8%D8%B1%D8%A7%DB%8C-%D8%AF%D9%88%D9%85%DB%8C%D9%86-%D8%A8%D8%A7%D8%B1-7ecb06d16e754c37b0d4b5d3fa15f285-th.png",
          description: `ادوبی پریمیر پرو (به انگلیسی: Adobe Premiere Pro) یک نرم‌افزار ویرایش ویدئو از شرکت ادوبی است. این محصول بخشی از استودیو تولید ادوبی می‌باشد و یک مجموعه از نرم‌افزارهای شنیداری و دیداری دیجیتال است. پریمیر نرم‌افزاری که با نهایت امکانات و تکنولوژی‌ها ویرایشی قدرتمند را برای فیلم‌ها امکان‌پذیر می‌سازد. اکثر فیلم‌ها. موزیک ویدئوها و ویدئوهایی تبلیغاتی که امروزه ما با نهایت کیفیت مشاهده می‌کنیم با این محصول ادوبی تدوین شده‌اند. این دوره برای تمام کسانی که علاقه مند یادگیری حرفه ای نرم افزار پریمیر برای کار تدوین در هر زمینه ای از جمله فیلم و سینما تا موضوعاتی مثل ساخت ویدئوهای تبلیغاتی، سینمایی، مستند، آموزشی، موزیک ویدیو، تلویزیونی، اینستاگرام هستند، مناسب می باشد. اگر دوره پایه را گذرانده اید و یا آشنایی مقدماتی با پریمیر دارید این دوره توصیه می شود.
        سرفصل های آموزشی این دوره:
        
        ۱-پروکسی و ترنسکد
        
        ۲-تدوین پیشرفته با استفاده از پروژه های تو در تو
        
        ۳-تدوین با چند دوربین
        
        ۴-استفاده از پلاگین ها و تنظیمات بخش opacity / Mask / Track motion  
        
        ۵-استفاده از چند افکت خاص و کاربردی تصویر و صدا
        
        ۶-ساخت تایتل و تیتراژ پیشرفته و زیرنویس
        
        ۷-تصحیح رنگ با پریمیر
        
        ۸-آشنایی با چند Meno  کاربردی  و تنظیمات آنها`,
        },
        {
          _id: 4,
          teacher_name: "هومن بابانوروزی ",
          teacher_description: "کصکنه چراغ دار",
          schedules: [
            { date: "1399/05/03", time: "1:30", priod: "5", _id: "61" },
            { date: "1399/05/04", time: "1:30", priod: "5", _id: "62" },
            { date: "1399/05/05", time: "1:30", priod: "5", _id: "63" },
            { date: "1399/05/06", time: "1:30", priod: "5", _id: "64" },
          ],
          start_at: "1399/05/04",
          title: "آموزش تدوین فیلم مستند دوره سوم « نیمه خصوصی »",
          price: "1500000",
          image:
            "http://onlineamoozan.ir/Uploads/Courses/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D8%AA%D8%AF%D9%88%DB%8C%D9%86-%D9%81%DB%8C%D9%84%D9%85-%D9%85%D8%B3%D8%AA%D9%86%D8%AF-%D8%AF%D9%88%D8%B1%D9%87-%D8%B3%D9%88%D9%85-%D9%86%DB%8C%D9%85%D9%87-%D8%AE%D8%B5%D9%88%D8%B5%DB%8C-595c5dfc840c4597afd92c75428ab787-th.jpg",
          description: `  
        اهداف این دوره به اختصار شامل چگونگی روند شروع و به پایان رساندن یک پروژه فیلم مستند، زیبایی شناسی تدوین و ایجاد فرم و طرح مونتاژ فیلم مستند، کار با نرم افزار ادوب پریمیر و تکنیک های مونتاژ فیلم مستند خواهد بود. زمان بندی این دوره از آموزش در ده جلسه سه ساعته و جمعا سی ساعت برگزار خواهد شد. این دوره همچنین برای افرادی که قصد تولید محتوای آموزشی، فرهنگی و هنری و غیره را دارند توصیه می شود. هنرجویان در این دوره یک مستند کوتاه را با همراهی و راهنمایی مدرس به طور کامل تدوین خواهند کرد. آموزش تدوین فیلم مستند در روش آنلاین کاملا کاربردی و قابل دریافت است و به مراتب از برگزاری کلاس حضوری مفیدتر خواهد بود و باعث صرفه جویی در وقت و هزینه هنرجویان می شود. لطفا قبل از تکمیل ثبت نام و مرحله پرداخت با ما در ارتباط باشید. اهداف این دوره به اختصار شامل چگونگی روند شروع و به پایان رساندن یک پروژه فیلم مستند، زیبایی شناسی تدوین و ایجاد فرم و طرح مونتاژ فیلم مستند، کار با نرم افزار ادوب پریمیر و تکنیک های مونتاژ فیلم مستند خواهد بود.
        
        اهداف این دوره به اختصار شامل چگونگی روند شروع و به پایان رساندن یک پروژه فیلم مستند، زیبایی شناسی تدوین و ایجاد فرم و طرح مونتاژ فیلم مستند، کار با نرم افزار ادوب پریمیر و تکنیک های مونتاژ فیلم مستند خواهد بود.  لطفا قبل از تکمیل ثبت نام و مرحله پرداخت با ما در ارتباط باشید.
        
        و صفحه استودیو فیلم کلوزآپ را در اینستاگرام دنبال کنید.`,
        },
      ],
    },
  });
}
export function getProductById(id) {
  return Promise.resolve({
    status: 200,
    data: {
      product: {
        _id: 4,
        teacher_name: "هومن بابانوروزی ",
        teacher_description: "خی",
        schedules: [
          { date: "1399/05/03", time: "1:30", priod: "6", _id: "61" },
          { date: "1399/05/04", time: "1:30", priod: "5", _id: "62" },
          { date: "1399/05/05", time: "1:30", priod: "5", _id: "63" },
          { date: "1399/05/06", time: "1:30", priod: "5", _id: "64" },
        ],
        start_at: "1399/05/04",
        startTime: "11:00",
        registered: "40",
        title: "آموزش تدوین فیلم مستند دوره سوم « نیمه خصوصی »",
        price: "1500000",
        price_title: "بدون تخفیف",
        strong: "50",
        image:
          "http://onlineamoozan.ir/Uploads/Courses/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D8%AA%D8%AF%D9%88%DB%8C%D9%86-%D9%81%DB%8C%D9%84%D9%85-%D9%85%D8%B3%D8%AA%D9%86%D8%AF-%D8%AF%D9%88%D8%B1%D9%87-%D8%B3%D9%88%D9%85-%D9%86%DB%8C%D9%85%D9%87-%D8%AE%D8%B5%D9%88%D8%B5%DB%8C-595c5dfc840c4597afd92c75428ab787-th.jpg",
        description: `  
        اهداف این دوره به اختصار شامل چگونگی روند شروع و به پایان رساندن یک پروژه فیلم مستند، زیبایی شناسی تدوین و ایجاد فرم و طرح مونتاژ فیلم مستند، کار با نرم افزار ادوب پریمیر و تکنیک های مونتاژ فیلم مستند خواهد بود. زمان بندی این دوره از آموزش در ده جلسه سه ساعته و جمعا سی ساعت برگزار خواهد شد. این دوره همچنین برای افرادی که قصد تولید محتوای آموزشی، فرهنگی و هنری و غیره را دارند توصیه می شود. هنرجویان در این دوره یک مستند کوتاه را با همراهی و راهنمایی مدرس به طور کامل تدوین خواهند کرد. آموزش تدوین فیلم مستند در روش آنلاین کاملا کاربردی و قابل دریافت است و به مراتب از برگزاری کلاس حضوری مفیدتر خواهد بود و باعث صرفه جویی در وقت و هزینه هنرجویان می شود. لطفا قبل از تکمیل ثبت نام و مرحله پرداخت با ما در ارتباط باشید. اهداف این دوره به اختصار شامل چگونگی روند شروع و به پایان رساندن یک پروژه فیلم مستند، زیبایی شناسی تدوین و ایجاد فرم و طرح مونتاژ فیلم مستند، کار با نرم افزار ادوب پریمیر و تکنیک های مونتاژ فیلم مستند خواهد بود.
        
        اهداف این دوره به اختصار شامل چگونگی روند شروع و به پایان رساندن یک پروژه فیلم مستند، زیبایی شناسی تدوین و ایجاد فرم و طرح مونتاژ فیلم مستند، کار با نرم افزار ادوب پریمیر و تکنیک های مونتاژ فیلم مستند خواهد بود.  لطفا قبل از تکمیل ثبت نام و مرحله پرداخت با ما در ارتباط باشید.
        
        و صفحه استودیو فیلم کلوزآپ را در اینستاگرام دنبال کنید.`,
      },
    },
  });
}
export function getCampaigns(token) {
  return Promise.resolve({ status: 200, data: data.campaigns });
}
